export const updateLogs: Record<string, Array<string>> = {
    "1.5.4": [
        "【新增】进入插件自动聚焦输入框"
    ],
    "1.5.3": [
        "【新增】新增主程序推送功能，开启主程序推送，可以在utools主页面进行搜索卡片内容",
        "【修复】修复AI功能无法使用的问题"
    ],
    "1.5.2": [
        "【新增】笔记支持图片了，可以粘贴图片到输入框（只有完整markdown编辑器支持），可以在设置中管理这些附件",
        "【更新】去除角色框"
    ],
    "1.5.1": [
        "【修复】markdown编辑器新增流程图与公式",
    ],
    "1.5.0": [
        "【更新】首页布局优化，更加美观",
        "【新增】新增markdown编辑器，功能更强大",
        "【预告】下个版本将推出角色功能，以不同的身份进行卡片记录，更方便的进行分类",
        "【预告】下个版本将推出加密卡片默认，让你的卡片更加安全"
    ],
    "1.4.0": [
        "【优化】优化了整体样式，使用圆角、阴影，使卡片更加立体",
        "【优化】对AI回答的内容和自己写的内容进行了区分",
        "【修复】修复代码拷贝时，可能出现的xss注入错误",
        "【新增】新增字体大小设置、字体设置，更加美观"
    ],
    "1.3.3": [
        "【新增】新增了关联图，如果一篇笔记关联了其他笔记，或者被其他笔记关联，则又上角会出现关联图标，点击后查询笔记之间的关联图",
    ],
    "1.3.2": [
        "【修复】修复了更新笔记关联，但是旧的关联不更新的问题",
        "【重大更新】新增AI功能，可以在设置 => AI设置中查看使用方法，目前只支持讯飞星火大模型",
        "【新功能】新增导出功能，可以导出指定分组的笔记为一个markdown文件，也可以在设置 => 导出中导出全部笔记到一个文件中，或者导出全部笔记为一个压缩包",
    ],
}
